app/Http/Helpers/helpers.php

select `active_template` from `general_settings` limit 1
---
function activeTemplate($asset = false)
{
    $general = GeneralSetting::first(['active_template']);

select * from `extensions` where `act` = 'google-analytics' and `status` = 1 limit 1
---
function loadAnalytics()
{
    $analytics = Extension::where('act', 'google-analytics')->where('status', 1)->first();

select * from `extensions` where `act` = 'tawk-chat' and `status` = 1 limit 1
---
function loadTawkto()
{
    $tawkto = Extension::where('act', 'tawk-chat')->where('status', 1)->first();

select * from `extensions` where `act` = 'fb-comment' and `status` = 1 limit 1
---
function loadFbComment()
{
    $comment = Extension::where('act', 'fb-comment')->where('status',1)->first();

select * from `general_settings` limit 1
select * from `email_sms_templates` where `act` = 'DONOR_CONTACT' and `sms_status` = 1 limit 1
---
function sendSms($user, $type, $shortCodes = [])
{
    $general = GeneralSetting::first();
    $smsTemplate = SmsTemplate::where('act', $type)->where('sms_status', 1)->first();

select * from `general_settings` limit 1
---
function sendEmail($user, $type = null, $shortCodes = [])
{
    $general = GeneralSetting::first();

select * from `frontends` where `data_keys` = 'breadcrumb.content' order by `id` desc limit 1
select * from `frontends` where `data_keys` = 'blog.element' order by `id` asc limit 3
select * from `frontends` where `data_keys` = 'policy_pages.element' order by `id` desc
---
function getContent($data_keys, $singleQuery = false, $limit = null,$orderById = false)
{
    if ($singleQuery) {
        $content = Frontend::where('data_keys', $data_keys)->orderBy('id','desc')->first();
    } else {
        $article = Frontend::query();
        $article->when($limit != null, function ($q) use ($limit) {
            return $q->limit($limit);
        });
        if($orderById){
            $content = $article->where('data_keys', $data_keys)->orderBy('id')->get();
        }else{
            $content = $article->where('data_keys', $data_keys)->orderBy('id','desc')->get();

select * from `advertisements` where `id` = 1 limit 1
update `advertisements` set `impression` = 187, `advertisements`.`updated_at` = '2023-02-01 22:06:15' where `id` = 1
---
function impressionCount($id)
{
    $item = Advertisement::where('id',$id)->first();
    $item->impression +=1;
    $item->save();

select * from `advertisements` where `status` = 1 and `size` = '220x474' order by RAND() limit 1
---
function advertisements($size) {
    $ad = Advertisement::where('status',1)->where('size', $size)->inRandomOrder()->first();