app/Http/Controllers/SiteController.php

select count(*) as aggregate from `pages` where `tempname` = 'templates.basic.' and `slug` = 'home'
select * from `pages` where `tempname` = 'templates.basic.' and `slug` = 'home' limit 1
select `id`, `name` from `bloods` where `status` = 1
select `id`, `name` from `cities` where `status` = 1
---
    public function index(){
        $count = Page::where('tempname',$this->activeTemplate)->where('slug','home')->count();
        if($count == 0){
            $page = new Page();
            $page->tempname = $this->activeTemplate;
            $page->name = 'HOME';
            $page->slug = 'home';
            $page->save();
        }
        $reference = @$_GET['reference'];
        if ($reference) {
            session()->put('reference', $reference);
        }
        $pageTitle = 'Home';
        $sections = Page::where('tempname',$this->activeTemplate)->where('slug','home')->first();
        $bloods = Blood::where('status', 1)->select('id', 'name')->get();
        $cities = City::where('status', 1)->select('id', 'name')->get();

select * from `pages` where `tempname` = 'templates.basic.' and `slug` = 'about-us' limit 1
---
    public function pages($slug)
    {
        $page = Page::where('tempname',$this->activeTemplate)->where('slug',$slug)->firstOrFail();

select `id`, `name` from `bloods` where `status` = 1
select * from `locations` where `locations`.`city_id` in (2, 3, 4, 5, 6, 8)
select `id`, `name` from `cities` where `status` = 1
select * from `bloods` where `bloods`.`id` in (2)
select * from `donors` where `status` = 1 limit 20 offset 0
select * from `locations` where `locations`.`id` in (9)
select count(*) as aggregate from `donors` where `status` = 1
---
    public function donor()
    {
        $pageTitle = "All Donor";
        $emptyMessage = "No data found";
        $bloods = Blood::where('status', 1)->select('id', 'name')->get();
        $cities = City::where('status', 1)->select('id', 'name')->with('location')->get();
        $donors = Donor::where('status',1)->with('blood', 'location')->paginate(getPaginate());

select * from `donors` where `status` = 1 and `id` = 1 limit 1
---
    public function donorDetails($slug, $id)
    {
        $pageTitle = "Donor Details";
        $donor = Donor::where('status',1)->where('id', decrypt($id))->firstOrFail();

select `id`, `name` from `locations` where `status` = 1
select `id`, `name` from `bloods` where `status` = 1
select `id`, `name` from `cities` where `status` = 1
select * from `bloods` where `bloods`.`id` in (2, 3)
select * from `donors` where `status` = 1 and `gender` = '2' limit 20 offset 0
select * from `locations` where `locations`.`id` in (5, 8, 9)
select count(*) as aggregate from `donors` where `status` = 1 and `gender` = '2'
---
    public function donorSearch(Request $request)
    {
        $request->validate([
            'location_id' => 'nullable|exists:locations,id',
            'city_id' => 'nullable|exists:cities,id',
            'blood_id' => 'nullable|exists:bloods,id',
            'gender' => 'nullable|in:1,2'
        ]);
        $locations = Location::where('status', 1)->select('id', 'name')->get();
        $bloods = Blood::where('status', 1)->select('id', 'name')->get();
        $cities = City::where('status', 1)->select('id', 'name')->get();
        $pageTitle = "Donor Search";
        $emptyMessage = "No data found";
        $locationId = $request->location_id;
        $cityId = $request->city_id;
        $bloodId = $request->blood_id;
        $gender = $request->gender;
        $donors = Donor::where('status', 1);
        if($request->blood_id){
            $donors = $donors->where('blood_id', $request->blood_id);
        }
        if($request->city_id){
            $donors = $donors->where('city_id', $request->city_id);
        }
        if($request->location_id){
            $donors = $donors->where('location_id', $request->location_id);
        }
        if($request->gender){
            $donors = $donors->where('gender', $request->gender);
        }
        $donors = $donors->with('blood', 'location')->paginate(getPaginate());

select * from `donors` where `donors`.`id` = '1' limit 1
---
    public function contactWithDonor(Request $request)
    {
        $request->validate([
            'donor_id' => 'required|exists:donors,id',
            'name' => 'required|max:80',
            'email' => 'required|max:80',
            'message' => 'required|max:500'
        ]);
        $donor = Donor::findOrFail($request->donor_id);

select * from `bloods` where `status` = 1 and `id` = 3 limit 1
select `id`, `name` from `bloods` where `status` = 1
select `id`, `name` from `cities` where `status` = 1
select `id`, `name` from `locations` where `status` = 1
select * from `bloods` where `bloods`.`id` in (3)
select * from `donors` where `status` = 1 and `blood_id` = 3 limit 20 offset 0
select * from `locations` where `locations`.`id` in (8)
select count(*) as aggregate from `donors` where `status` = 1 and `blood_id` = 3
---
    public function bloodGroup($slug, $id)
    {
        $blood = Blood::where('status', 1)->where('id', decrypt($id))->firstOrFail();
        $pageTitle = $blood->name." Blood Group Donor";
        $emptyMessage = "No data found";
        $bloods = Blood::where('status', 1)->select('id', 'name')->get();
        $cities = City::where('status', 1)->select('id', 'name')->get();
        $locations = Location::where('status', 1)->select('id', 'name')->get();
        $donors = Donor::where('status',1)->where('blood_id', $blood->id)->with('blood', 'location')->paginate(getPaginate());

select * from `pages` where `tempname` = 'templates.basic.' and `slug` = 'contact' limit 1
---
    public function contact()
    {
        $pageTitle = "Contact Us";
        $sections = Page::where('tempname',$this->activeTemplate)->where('slug','contact')->first();

select * from `frontends` where `data_keys` = 'blog.element' limit 9 offset 0
select count(*) as aggregate from `frontends` where `data_keys` = 'blog.element'
select * from `pages` where `tempname` = 'templates.basic.' and `slug` = 'blog' limit 1
---
    public function blog(){
        $pageTitle = "Blog";
        $blogs = Frontend::where('data_keys','blog.element')->paginate(9);
        $sections = Page::where('tempname',$this->activeTemplate)->where('slug','blog')->first();

select * from `frontends` where `data_keys` = 'blog.element' order by `created_at` desc limit 6
select * from `frontends` where `id` = '26' and `data_keys` = 'blog.element' limit 1
---
    public function blogDetails($id,$slug){
        $blogs = Frontend::where('data_keys','blog.element')->latest()->limit(6)->get();
        $blog = Frontend::where('id',$id)->where('data_keys','blog.element')->firstOrFail();

select * from `frontends` where `id` = '42' and `data_keys` = 'policy_pages.element' limit 1
---
    public function footerMenu($slug, $id)
    {
        $data = Frontend::where('id', $id)->where('data_keys', 'policy_pages.element')->firstOrFail();

select * from `locations` where `locations`.`city_id` in (2, 3, 4, 5, 6, 8)
select `id`, `name` from `cities` where `status` = 1
select `id`, `name` from `bloods` where `status` = 1
---
    public function applyDonor()
    {
        $pageTitle = "Apply as a Donor";
        $cities = City::where('status', 1)->select('id', 'name')->with('location')->get();
        $bloods = Blood::where('status', 1)->select('id', 'name')->get();

insert into `donors` (`name`, `email`, `phone`, `city_id`, `blood_id`, `location_id`, `gender`, `religion`, `profession`, `address`, `details`, `total_donate`, `birth_date`, `last_donate`, `socialMedia`, `image`, `updated_at`, `created_at`) values ('Zeel Lakhani', 'zeellakhani@gmail.com', '8855555566', '2', '6', '2', '1', 'Hindu', 'Jwellary Expert', 'Blue Star Recedency', 'Jwellary Expert', '13', '2000-09-15 00:00:00', '2022-09-13 00:00:00', '{\"facebook\":\"https:\/\/facebook.com\",\"twitter\":\"https:\/\/twitter.com\",\"linkedinIn\":\"https:\/\/linkedin.com\",\"instagram\":\"https:\/\/instagram.com\"}', '63daeffcca4351675292668.png', '2023-02-01 23:04:28', '2023-02-01 23:04:28')
---
            }
            $donor->image = $filename;
        }
        $donor->save();