app/Providers/AppServiceProvider.php

    public function boot()
    {
        $activeTemplate = activeTemplate();
        $general = GeneralSetting::first();
        $viewShare['general'] = $general;
        $viewShare['activeTemplate'] = $activeTemplate;
        $viewShare['activeTemplateTrue'] = activeTemplate(true);
        $viewShare['language'] = Language::all();
        $viewShare['pages'] = Page::where('tempname',$activeTemplate)->where('slug','!=','home')->get();
        view()->share($viewShare);

        view()->composer('admin.partials.sidenav', function ($view) {
            $view->with([
                'pending_ticket_count' => SupportTicket::whereIN('status', [0,2])->count(),
                'pending_donor_count' => Donor::where('status', 0)->count(),
            ]);
        });

        view()->composer('partials.seo', function ($view) {
            $seo = Frontend::where('data_keys', 'seo.data')->first();
---
select count(*) as aggregate from `support_tickets` where `status` in (0, 2)
select count(*) as aggregate from `donors` where `status` = 0
select * from `frontends` where `data_keys` = 'seo.data' limit 1