app/Http/Controllers/Admin/AdvertisementController.php

    public function index(Request $request)
    {
        $pageTitle = "All Advertisements";
        $emptyMessage = "No data found";
        $ads = Advertisement::latest()->paginate(getPaginate());
---
select * from `advertisements` order by `created_at` desc limit 20 offset 0
select count(*) as aggregate from `advertisements`