app/Http/Controllers/Admin/BloodController.php

    public function index()
    {
        $pageTitle = "Manage Blood Group";
        $emptyMessage = "No data found";
        $bloods = Blood::latest()->paginate(getPaginate());
---
select * from `bloods` order by `created_at` desc limit 20 offset 0
select count(*) as aggregate from `bloods`

    public function store(Request $request)
    {
        $request->validate(['name' => 'required|max:60']);
        $blood = new Blood();
        $blood->name = $request->name;
        $blood->status = $request->status ? 1: 0;
        $blood->save();
---
insert into `bloods` (`name`, `status`, `updated_at`, `created_at`) values ('A+', 1, '2023-02-01 21:45:46', '2023-02-01 21:45:46')