app/Http/Controllers/Admin/CityController.php

select * from `cities` order by `created_at` desc limit 20 offset 0
select count(*) as aggregate from `cities`
---
    public function index()
    {
        $pageTitle = "Manage City";
        $emptyMessage = "No Data Found";
        $citys = City::latest()->paginate(getPaginate());

insert into `cities` (`name`, `status`, `updated_at`, `created_at`) values ('Surat', 1, '2023-02-01 21:47:56', '2023-02-01 21:47:56')
---
    public function store(Request $request)
    {
        $request->validate(['name' => 'required|max:80']);
        $city = new City();
        $city->name = $request->name;
        $city->status = $request->status ? 1: 0;
        $city->save();