app/Http/Controllers/Admin/LocationController.php

    public function index()
    {
        $pageTitle = "Manage Location";
        $emptyMessage = "No data found";
        $locations = Location::latest()->with('city')->paginate(getPaginate());
        $citys = City::where('status', 1)->select('id', 'name')->get();
---
select * from `cities` where `cities`.`id` in (2, 3, 4, 5, 6)
select * from `locations` order by `created_at` desc limit 20 offset 0
select count(*) as aggregate from `locations`
select `id`, `name` from `cities` where `status` = 1

    public function store(Request $request)
    {
        $request->validate([
            'name' => 'required|max:255',
            'city' => 'required|exists:cities,id',
        ]);
        $location = new Location();
        $location->name = $request->name;
        $location->city_id = $request->city;
        $location->status = $request->status ? 1: 0;
        $location->save();
---
insert into `locations` (`name`, `city_id`, `status`, `updated_at`, `created_at`) values ('Karjan', '8', 1, '2023-02-01 21:52:12', '2023-02-01 21:52:12')