app/Http/Controllers/Admin/ManageDonorController.php

select `id`, `name` from `bloods` where `status` = 1
select * from `bloods` where `bloods`.`id` in (2, 3, 4, 5, 6, 7, 8)
select * from `donors` order by `created_at` desc limit 20 offset 0
select * from `locations` where `locations`.`id` in (2, 3, 4, 5, 7, 8, 9)
select count(*) as aggregate from `donors`
---
    public function index()
    {
        $pageTitle = "Manage Donor List";
        $emptyMessage = "No data found";
        $bloods = Blood::where('status', 1)->select('id', 'name')->get();
        $donors = Donor::latest()->with('blood', 'location')->paginate(getPaginate());

select `id`, `name` from `bloods` where `status` = 1
select * from `bloods` where `bloods`.`id` in (3, 6)
select * from `donors` where `status` = 0 order by `created_at` desc limit 20 offset 0
select * from `locations` where `locations`.`id` in (2, 8)
select count(*) as aggregate from `donors` where `status` = 0
---
    public function pending()
    {
        $pageTitle = "Pending Donor List";
        $emptyMessage = "No data found";
        $bloods = Blood::where('status', 1)->select('id', 'name')->get();
        $donors = Donor::where('status', 0)->latest()->with('blood', 'location')->paginate(getPaginate());

select `id`, `name` from `bloods` where `status` = 1
select * from `bloods` where `bloods`.`id` in (2, 3, 4, 5, 6, 7, 8)
select * from `donors` where `status` = 1 order by `created_at` desc limit 20 offset 0
select * from `locations` where `locations`.`id` in (2, 3, 4, 5, 7, 8, 9)
select count(*) as aggregate from `donors` where `status` = 1
---
    public function approved()
    {
        $pageTitle = "Approved Donor List";
        $emptyMessage = "No data found";
        $bloods = Blood::where('status', 1)->select('id', 'name')->get();
        $donors = Donor::where('status', 1)->latest()->with('blood', 'location')->paginate(getPaginate());

select `id`, `name` from `bloods` where `status` = 1
select * from `bloods` where `bloods`.`id` in (3)
select * from `donors` where `status` = 2 order by `created_at` desc limit 20 offset 0
select * from `locations` where `locations`.`id` in (8)
select count(*) as aggregate from `donors` where `status` = 2
---
    public function banned()
    {
        $pageTitle = "Banned Donor List";
        $emptyMessage = "No data found";
        $bloods = Blood::where('status', 1)->select('id', 'name')->get();
        $donors = Donor::where('status', 2)->latest()->with('blood', 'location')->paginate(getPaginate());

select * from `locations` where `locations`.`city_id` in (2, 3, 4, 5, 6, 8)
select `id`, `name` from `cities` where `status` = 1
select `id`, `name` from `bloods` where `status` = 1
---
    public function create()
    {
        $pageTitle = "Donor Create";
        $cities = City::where('status', 1)->select('id', 'name')->with('location')->get();
        $bloods = Blood::where('status', 1)->select('id', 'name')->get();

select * from `donors` where `donors`.`id` = '10' limit 1
update `donors` set `status` = 2, `donors`.`updated_at` = '2023-02-01 23:35:05' where `id` = 10
---
    public function bannedStatus(Request $request)
    {
        $request->validate([
            'id' => 'required|exists:donors,id'
        ]);
        $donor = Donor::findOrFail($request->id);
        $donor->status = 2;
        $donor->save();

select * from `donors` where `donors`.`id` = '9' limit 1
update `donors` set `featured` = 1, `donors`.`updated_at` = '2023-02-01 22:43:21' where `id` = 9
---
    public function featuredInclude(Request $request)
    {
        $request->validate([
            'id' => 'required|exists:donors,id'
        ]);
        $donor = Donor::findOrFail($request->id);
        $donor->featured = 1;
        $donor->save();

insert into `donors` (`name`, `email`, `phone`, `city_id`, `blood_id`, `location_id`, `gender`, `religion`, `profession`, `address`, `details`, `total_donate`, `birth_date`, `last_donate`, `socialMedia`, `image`, `status`, `updated_at`, `created_at`) values ('Ms. Dipali Dave', 'dnd02@ganpatuniversity.ac.in', '8555444476', '5', '2', '5', '2', 'Hindu', 'Professor', '22-Laxmi Enclave', 'Assistant Professor', '9', '1995-08-02 00:00:00', '2020-08-19 00:00:00', '{\"facebook\":\"https:\/\/facebook.com\",\"twitter\":\"https:\/\/twitter.com\",\"linkedinIn\":\"https:\/\/linkedin.com\",\"instagram\":\"https:\/\/instagram.com\"}', '63dae8f76a3451675290871.png', 1, '2023-02-01 22:34:31', '2023-02-01 22:34:31')
---
            $donor->image = $filename;
        }
        $donor->status = $request->status ? 1 : 2;
        $donor->save();