app/Http/Controllers/Admin/SupportTicketController.php

    public function tickets()
    {
        $pageTitle = 'Support Tickets';
        $emptyMessage = 'No Data found.';
        $items = SupportTicket::orderBy('id','desc')->paginate(getPaginate());
---
select * from `support_tickets` order by `id` desc limit 20 offset 0
select count(*) as aggregate from `support_tickets`

    public function pendingTicket()
    {
        $pageTitle = 'Pending Tickets';
        $emptyMessage = 'No Data found.';
        $items = SupportTicket::whereIn('status', [0,2])->orderBy('priority', 'DESC')->orderBy('id','desc')->paginate(getPaginate());
---
select * from `support_tickets` where `status` in (0, 2) order by `priority` desc, `id` desc limit 20 offset 0
select count(*) as aggregate from `support_tickets` where `status` in (0, 2)

    public function answeredTicket()
    {
        $pageTitle = 'Answered Tickets';
        $emptyMessage = 'No Data found.';
        $items = SupportTicket::orderBy('id','desc')->where('status',1)->paginate(getPaginate());
---
select count(*) as aggregate from `support_tickets` where `status` = 1